import all the important libraries

In [5]:
import pandas as pd
import numpy as np

load the dataset using pandas

In [6]:
data_file = pd.read_csv('chipotle.tsv', sep='\t')

In [5]:
print(data_file)

      order_id  quantity                              item_name  \
0            1         1           Chips and Fresh Tomato Salsa
1            1         1                                   Izze
2            1         1                       Nantucket Nectar
3            1         1  Chips and Tomatillo-Green Chili Salsa
4            2         2                           Chicken Bowl
...        ...       ...                                    ...
4617      1833         1                          Steak Burrito
4618      1833         1                          Steak Burrito
4619      1834         1                     Chicken Salad Bowl
4620      1834         1                     Chicken Salad Bowl
4621      1834         1                     Chicken Salad Bowl

                                     choice_description item_price
0                                                   NaN     $2.39
1                                          [Clementine]     $3.39
2                                               [Apple]     $3.39
3                                                   NaN     $2.39
4     [Tomatillo-Red Chili Salsa (Hot), [Black Beans...    $16.98
...                                                 ...        ...
4617  [Fresh Tomato Salsa, [Rice, Black Beans, Sour ...    $11.75
4618  [Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...    $11.75
4619  [Fresh Tomato Salsa, [Fajita Vegetables, Pinto...    $11.25
4620  [Fresh Tomato Salsa, [Fajita Vegetables, Lettu...     $8.75
4621  [Fresh Tomato Salsa, [Fajita Vegetables, Pinto...     $8.75

[4622 rows x 5 columns]

print first 5 and last 7 records

In [6]:
data_file.head(5)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [7]:
data_file.tail(7)

,order_id,quantity,item_name,choice_description,item_price
4615,1832,1,Chicken Soft Tacos,"[Fresh Tomato Salsa, [Rice, Cheese, Sour Cream]]",$8.75
4616,1832,1,Chips and Guacamole,NaN,$4.45
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

print total records and type of variables

In [9]:
data_file.shape

(4622, 5)

In [10]:
data_file.dtypes

order_id               int64
quantity               int64
item_name             object
choice_description    object
item_price            object
dtype: object

Print the name of all the columns.

In [12]:
data_file.columns

Index(['order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

How is the dataset indexed?

In [17]:
#column indexing 

print(data_file['quantity'])

#row indexing
data_file.iloc[1:3,1:4]

0       1
1       1
2       1
3       1
4       2
       ..
4617    1
4618    1
4619    1
4620    1
4621    1
Name: quantity, Length: 4622, dtype: int64

   quantity         item_name choice_description
1         1              Izze       [Clementine]
2         1  Nantucket Nectar            [Apple]

Which was the most ordered item? and How many items were ordered?

In [43]:
# data_file.at[max(data_file['quantity']),'item_name']
a = list(data_file['quantity']).index(max(list(data_file['quantity'])))
print(a)
data_file.loc[3598]

3598

order_id                                      1443
quantity                                        15
item_name             Chips and Fresh Tomato Salsa
choice_description                             NaN
item_price                                   44.25
Name: 3598, dtype: object

What was the most ordered item in the choice_description column?

In [49]:
# data_file.at[max(data_file['quantity']),'choice_description']
b = data_file.dropna(axis = 1)
print(b)
a = list(data_file['quantity']).index(max(list(data_file['quantity'])))
print(a)
data_file.loc[3598]

      order_id  quantity                              item_name  item_price
0            1         1           Chips and Fresh Tomato Salsa        2.39
1            1         1                                   Izze        3.39
2            1         1                       Nantucket Nectar        3.39
3            1         1  Chips and Tomatillo-Green Chili Salsa        2.39
4            2         2                           Chicken Bowl       16.98
...        ...       ...                                    ...         ...
4617      1833         1                          Steak Burrito       11.75
4618      1833         1                          Steak Burrito       11.75
4619      1834         1                     Chicken Salad Bowl       11.25
4620      1834         1                     Chicken Salad Bowl        8.75
4621      1834         1                     Chicken Salad Bowl        8.75

[4622 rows x 4 columns]
3598

order_id                                      1443
quantity                                        15
item_name             Chips and Fresh Tomato Salsa
choice_description                             NaN
item_price                                   44.25
Name: 3598, dtype: object

 Turn the item price into a float

In [22]:

# data_file.item_price = data_file.item_price.astype(float)
data_file['item_price'] = data_file['item_price'].str.replace('$', '')
data_file['item_price']
data_file['item_price'] = data_file['item_price'].astype(float)
# data_file['item_price'] = pd.to_numeric(data_file['item_price'])

How much was the revenue for the period in the dataset?

In [63]:
data_file.dtypes

order_id                int64
quantity                int64
item_name              object
choice_description     object
item_price            float64
dtype: object

In [67]:
data_file['Revenue'] = data_file['quantity'] * data_file['item_price']

In [69]:
data_file
data_file.Revenue.sum()

39237.02

print a data frame with only two columns item_name and item_price

In [75]:
data_file[['item_name', 'item_price']]

                                  item_name  item_price
0              Chips and Fresh Tomato Salsa        2.39
1                                      Izze        3.39
2                          Nantucket Nectar        3.39
3     Chips and Tomatillo-Green Chili Salsa        2.39
4                              Chicken Bowl       16.98
...                                     ...         ...
4617                          Steak Burrito       11.75
4618                          Steak Burrito       11.75
4619                     Chicken Salad Bowl       11.25
4620                     Chicken Salad Bowl        8.75
4621                     Chicken Salad Bowl        8.75

[4622 rows x 2 columns]

What was the quantity of the most expensive item ordered?

In [27]:
data_file.head(5)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98

In [39]:
# data_file[data_file['item_price'] == data_file['item_price'].max()].shape[0]
a = list(data_file['item_price']).index(max(list(data_file['item_price'])))
print(a)

44.25
3598

In [41]:
data_file.loc[3598]['item_name']

'Chips and Fresh Tomato Salsa'